# Introduction to Pandas

We first start by importing Pandas

In [1]:
import pandas as pd

## Reading and Importing Data

We are going to use the House Sales in King County, USA dataset from Kaggle: https://www.kaggle.com/datasets/harlfoxem/housesalesprediction?select=kc_house_data.csv

In [2]:
df = pd.read_csv('kc_house_data.csv')

In [3]:
df

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000.0,2,1.00,770,10000,1.0,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000.0,4,3.00,1960,5000,1.0,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000.0,3,2.00,1680,8080,1.0,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
21608,263000018,20140521T000000,360000.0,3,2.50,1530,1131,3.0,0,0,...,8,1530,0,2009,0,98103,47.6993,-122.346,1530,1509
21609,6600060120,20150223T000000,400000.0,4,2.50,2310,5813,2.0,0,0,...,8,2310,0,2014,0,98146,47.5107,-122.362,1830,7200
21610,1523300141,20140623T000000,402101.0,2,0.75,1020,1350,2.0,0,0,...,7,1020,0,2009,0,98144,47.5944,-122.299,1020,2007
21611,291310100,20150116T000000,400000.0,3,2.50,1600,2388,2.0,0,0,...,8,1600,0,2004,0,98027,47.5345,-122.069,1410,1287
21612,1523300157,20141015T000000,325000.0,2,0.75,1020,1076,2.0,0,0,...,7,1020,0,2008,0,98144,47.5941,-122.299,1020,1357

## Initial Manipulation

We now move to data manipulation. Having inspected the data, we now we wish to extract and manipulate what is useful for our analysis.

### Missing Values

There are three types of missing data:


1.   Missing Completely at Random (MCAR): There is no relationship between if a missing data point and any of the other variables in the dataset. The missing values are a subset of the dataset.
2.   Missing at Random (MAR): The missing values are related to the other observed variables.
3.   Missing Not at Random (MNAR): The missing values are related to the values of the column itself. It is impossible to know if the values are MNAR without knowing the actual values themselves.

We will focus on two methods for dealing with missing values:


1.   Deletion: Deleting the rows or columns
2.   Imputation: Replacing the missing values by either the median, mean, mode

We will first start by adding missing values to our dataset. For the sake of this exercise we will use a subset of the main dataset.

missing_percentage is a variable where we want to represent a dataset where 15% of the values are missing for experimenting

In [14]:
import numpy as np
missing_percentage = 0.15  # 10% missing values

In [15]:
list_cols = ['price', 'bedrooms', 'bathrooms', 'condition'] ## we will consider those columns only
df_ = df[list_cols].copy()

np.random.rand(*df_.shape) generates a randome array of the shme shape as the datafram and contains random numbers btw 0 & 1
mask = np.random.rand(*df_.shape)< missing_percentage creates a bool mask where each element is true if the corresponding random number is less than the missing % indication that the value should be marked as missing
df_[mask] = np.nan assigns NaN to the elements of the df_ where the element is true
in a nutshell, this code randomly sets a % of values to NaN based on missing %

In [16]:
mask = np.random.rand(*df_.shape) < missing_percentage
df_[mask] = np.nan

In [17]:
df_.info() # Clearly: we can see the missing values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   price      18300 non-null  float64
 1   bedrooms   18331 non-null  float64
 2   bathrooms  18345 non-null  float64
 3   condition  18383 non-null  float64
dtypes: float64(4)
memory usage: 675.5 KB

In [22]:
df_.head(6)

       price  bedrooms  bathrooms  condition
0   221900.0       3.0       1.00        3.0
1   538000.0       3.0       2.25        3.0
2   180000.0       NaN       1.00        3.0
3   604000.0       NaN       3.00        5.0
4   510000.0       3.0       2.00        3.0
5  1230000.0       4.0       4.50        3.0

First up: deleting the rows containing missing values

```
df_cleaned = df.dropna()
```

This method will delete all rows across all columns. We can limit its scope by specifying which columns to consider when deleting rows

```
df_cleaned = df.dropna(subset=['column_name1', 'column_name2', ...])
```

Applying it on our dataset:

In [23]:
len(df_) # number of rows before deleting the missing values

21613

In [24]:
df_cleaned = df_.dropna()
print(len(df_cleaned)) # number of rows after deleting the missing values

11172

rows with missing values are deleted

In [26]:
df_cleaned.head(10)

        price  bedrooms  bathrooms  condition
0    221900.0       3.0       1.00        3.0
1    538000.0       3.0       2.25        3.0
4    510000.0       3.0       2.00        3.0
5   1230000.0       4.0       4.50        3.0
7    291850.0       3.0       1.50        3.0
8    229500.0       3.0       1.00        3.0
10   662500.0       3.0       2.50        3.0
11   468000.0       2.0       1.00        4.0
12   310000.0       3.0       1.00        4.0
15   650000.0       4.0       3.00        3.0

df_.dropna(subset=['condition' , 'price']) deltes rows containing missing values in condition and price columns only

In [29]:
df_cleaned = df_.dropna(subset=['condition', 'price']) # try other columns
print(len(df_cleaned))
df_cleaned.head(10)

15562

       price  bedrooms  bathrooms  condition
0   221900.0       3.0       1.00        3.0
1   538000.0       3.0       2.25        3.0
2   180000.0       NaN       1.00        3.0
3   604000.0       NaN       3.00        5.0
4   510000.0       3.0       2.00        3.0
5  1230000.0       4.0       4.50        3.0
6   257500.0       3.0        NaN        3.0
7   291850.0       3.0       1.50        3.0
8   229500.0       3.0       1.00        3.0
9   323000.0       3.0        NaN        3.0

Next, as mentioned above, we replace the missing values by several quantities. Before doing so we need to quickly go over the calculation of certain quantities of our dataset.

In [31]:
df_['bedrooms'].mean()

3.3699198079755606

In [32]:
df_.median()

price        450000.00
bedrooms          3.00
bathrooms         2.25
condition         3.00
dtype: float64

In [34]:
df_.mode().iloc[0]

price        350000.0
bedrooms          3.0
bathrooms         2.5
condition         3.0
Name: 0, dtype: float64

In [35]:
df.describe()

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
count,2.161300e+04,2.161300e+04,21613.000000,21613.000000,21613.000000,2.161300e+04,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000
mean,4.580302e+09,5.401822e+05,3.370842,2.114757,2079.899736,1.510697e+04,1.494309,0.007542,0.234303,3.409430,7.656873,1788.390691,291.509045,1971.005136,84.402258,98077.939805,47.560053,-122.213896,1986.552492,12768.455652
std,2.876566e+09,3.673622e+05,0.930062,0.770163,918.440897,4.142051e+04,0.539989,0.086517,0.766318,0.650743,1.175459,828.090978,442.575043,29.373411,401.679240,53.505026,0.138564,0.140828,685.391304,27304.179631
min,1.000102e+06,7.500000e+04,0.000000,0.000000,290.000000,5.200000e+02,1.000000,0.000000,0.000000,1.000000,1.000000,290.000000,0.000000,1900.000000,0.000000,98001.000000,47.155900,-122.519000,399.000000,651.000000
25%,2.123049e+09,3.219500e+05,3.000000,1.750000,1427.000000,5.040000e+03,1.000000,0.000000,0.000000,3.000000,7.000000,1190.000000,0.000000,1951.000000,0.000000,98033.000000,47.471000,-122.328000,1490.000000,5100.000000
50%,3.904930e+09,4.500000e+05,3.000000,2.250000,1910.000000,7.618000e+03,1.500000,0.000000,0.000000,3.000000,7.000000,1560.000000,0.000000,1975.000000,0.000000,98065.000000,47.571800,-122.230000,1840.000000,7620.000000
75%,7.308900e+09,6.450000e+05,4.000000,2.500000,2550.000000,1.068800e+04,2.000000,0.000000,0.000000,4.000000,8.000000,2210.000000,560.000000,1997.000000,0.000000,98118.000000,47.678000,-122.125000,2360.000000,10083.000000
max,9.900000e+09,7.700000e+06,33.000000,8.000000,13540.000000,1.651359e+06,3.500000,1.000000,4.000000,5.000000,13.000000,9410.000000,4820.000000,2015.000000,2015.000000,98199.000000,47.777600,-121.315000,6210.000000,871200.000000

On to replacing the missing values by those quantities:

In [53]:
# Replace missing values with the median of each column
df_filled_with_median = df_.fillna(df_.mean())

In [54]:
df_filled_with_median.mean() # now do the same but using the other methods

price        539943.883607
bedrooms          3.369920
bathrooms         2.113451
condition         3.409074
dtype: float64

[100,000; 200,000] --> 2 - 3 bedrooms, 3 bathrooms, grade 6, waterfront 0

[200,000; 400,000] --> 3 bedrooms, 3 bathrooms, grade 7, watefront 0

In [59]:
df.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'grade',
       'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode',
       'lat', 'long', 'sqft_living15', 'sqft_lot15'],
      dtype='object')

Note: Some columns might seem to be numerical but are not really numerical in the actual sense. Can you guess which ones? Treating missing values in those columns is different than in actual numerical columns

Bonus: How can we treat each column separately?

numerical variables represent quantities and are measurable on a numerical scale
categorical variables represent characteristics 
if a variable doesn't have a numerical meaning, or shouldn't be involved in math operations,it's treated as categorical
we can convert them to the category data type in pandas using astype() function for example:
df['bathrooms'] = df['bathrooms'].astype('category')

there are some cases were categorical variables are encoded as numerical variables for convenience.
in our study: grade, waterfront, view, condition, and zipcode are categorical because they represent characteristics and arithmetic operations don't make sense in the context of their intended use

### Dropping Rows

Deleting rows is a useful approach in certain situations. While not always used, it is important to have an understanding of how to do it and the different approaches. We can either delete rows by:


1.   Index
2.   Condition

Deleting by index can be done in two ways. The first is by specifying the index label:

```
indices = [1, 5, 9]
df_drop = df.drop(indices_to_delete)
```

The second is by specifying the position of the index:

```
indices = [1, 5, 9]
df_drop = df.drop(df.index(indices)
```

Bonus: How can we make use of the 'inplace' here?

The inplace is a parameter. when inplace=ture the method modifies the object directly without creating a new one
else the method returns a new modified object while leaving the original one unchanged

we can make use of the inplace parameter here by adding it to the df.drop as follows:
indices = [1, 5, 9]
 df.drop(df.index[indices], inplace=True)


Deleting by conditions is a bit different but boils down to the same principle.

```
condition = df['column_1'] > 15.5
df_drop = df[~condition]
```

The ~ is basically a negation; we negate the condition. This method is very useful for filtering as well.

Bonus: How can we filter using several conditions?

In [62]:
condition = (df['bedrooms'] > 3) & (df['bathrooms'] > 5)# you can think of more complex approaches or conditions, this is just a simple example
df_drop = df[~condition]

In [63]:
df_drop.bedrooms.value_counts()

bedrooms
3     9824
4     6871
2     2760
5     1583
6      265
1      199
7       34
0       13
8       12
9        5
10       2
11       1
33       1
Name: count, dtype: int64

In [64]:
# Try here:
df_.head()

      price  bedrooms  bathrooms  condition
0  221900.0       3.0       1.00        3.0
1  538000.0       3.0       2.25        3.0
2  180000.0       NaN       1.00        3.0
3  604000.0       NaN       3.00        5.0
4  510000.0       3.0       2.00        3.0

In [65]:
df_.drop(4).head()

       price  bedrooms  bathrooms  condition
0   221900.0       3.0       1.00        3.0
1   538000.0       3.0       2.25        3.0
2   180000.0       NaN       1.00        3.0
3   604000.0       NaN       3.00        5.0
5  1230000.0       4.0       4.50        3.0

### Sorting and Renaming

Coming in a bit late, but useful nonetheless, a dataframe can be sorted using the following function:

```
df.sort_values(column_name)
```

Setting ascending equal to False will sort the values from highest to lowest

In [66]:
df_.sort_values('price', ascending =False).head(4) # If ascending is equal to True, then the values are sorted from lowest to highest

          price  bedrooms  bathrooms  condition
7252  7700000.0       6.0       8.00        4.0
3914  7060000.0       5.0        NaN        3.0
9254  6890000.0       6.0       7.75        3.0
4411  5570000.0       5.0       5.75        3.0

The last element for this session has to do with renaming columns. One or more columns can be renamed as such:

```
df.rename(columns = {'old_name_1' : 'new_name_1', 'old_name_2' : 'new_name_2')
```

In [67]:
df_.rename(columns = {'price' : 'price_', 'bedrooms' : 'nb_bedrooms'}, inplace=True)

In [68]:
df_.head()

     price_  nb_bedrooms  bathrooms  condition
0  221900.0          3.0       1.00        3.0
1  538000.0          3.0       2.25        3.0
2  180000.0          NaN       1.00        3.0
3  604000.0          NaN       3.00        5.0
4  510000.0          3.0       2.00        3.0